{
  "translation": {
    "id": "hau_bib",
    "name": "Biblica® Buɗaɗɗen Littafi Mai Tsarki, Sabon Rai Don Kowa™",
    "website": "https://ebible.org/Scriptures/details.php?id=hausa",
    "licenseUrl": "https://ebible.org/Scriptures/details.php?id=hausa",
    "shortName": "BIB",
    "englishName": "BIB",
    "language": "hau",
    "textDirection": "ltr",
    "sha256": "f7b98712d68944c90ac6eda799ede1e61c24c14e7b2140ccb01e230d07e049ba",
    "availableFormats": [
      "json"
    ],
    "listOfBooksApiLink": "/api/hau_bib/books.json",
    "numberOfBooks": 65,
    "totalNumberOfChapters": 1177,
    "totalNumberOfVerses": 30730,
    "languageName": "Hausa",
    "languageEnglishName": "Hausa"
  },
  "book": {
    "id": "1CH",
    "translationId": "hau_bib",
    "name": "1 Tarihi",
    "commonName": "1 Tarihi",
    "title": "1 Tarihi",
    "order": 13,
    "numberOfChapters": 29,
    "sha256": "58728037d2d2596584c22f74f4237d051f05692ec18384a686c105a6b57df85c",
    "firstChapterApiLink": "/api/hau_bib/1CH/1.json",
    "lastChapterApiLink": "/api/hau_bib/1CH/29.json",
    "totalNumberOfVerses": 942
  },
  "chapter": {
    "number": 22,
    "content": [
      {
        "type": "verse",
        "number": 1,
        "content": [
          "Sai Dawuda ya ce, “Gidan Ubangiji Allah zai kasance a nan, haka kuma bagaden hadaya ta ƙonawa don Isra’ila.”"
        ]
      },
      {
        "type": "heading",
        "content": [
          "Shirye-shirye don haikali"
        ]
      },
      {
        "type": "verse",
        "number": 2,
        "content": [
          "Dawuda kuwa ya umarta a tattara baƙin da suke zama a Isra’ila, daga cikinsu ya sa masu farfasa duwatsu don su shirya duwatsun da aka sassaƙa saboda ginin gidan Allah."
        ]
      },
      {
        "type": "verse",
        "number": 3,
        "content": [
          "Ya tanada ƙarfe mai yawa don ƙusoshi saboda ƙyamaren hanyoyin shiga da kuma saboda mahaɗai, da ƙarin tagulla fiye da ƙirge."
        ]
      },
      {
        "type": "verse",
        "number": 4,
        "content": [
          "Ya kuma tanada gumaguman al’ul masu yawa fiye da ƙirge, gama Sidoniyawa da mutanen Taya sun kawo su wa Dawuda da yawa."
        ]
      },
      {
        "type": "verse",
        "number": 5,
        "content": [
          "Dawuda ya ce, “Ɗana Solomon matashi ne kuma bai gogu ba, kuma gidan da za a gina wa Ubangiji zai zama mai ƙayatarwa ƙwarai, sananne da kuma mai daraja a idon dukan al’ummai. Saboda haka zan yi shirye-shirye saboda shi.” Sai Dawuda ya yi ɗumbun shirye-shirye kafin mutuwarsa."
        ]
      },
      {
        "type": "verse",
        "number": 6,
        "content": [
          "Sa’an nan ya kira ɗansa Solomon ya umarce shi yă gina gida domin Ubangiji, Allah na Isra’ila."
        ]
      },
      {
        "type": "verse",
        "number": 7,
        "content": [
          "Dawuda ya ce wa Solomon, “Ɗana, na yi niyya a zuciyata in gina gida saboda Sunan Ubangiji Allahna."
        ]
      },
      {
        "type": "verse",
        "number": 8,
        "content": [
          "Amma wannan maganar Ubangiji ta zo mini, ‘Ka zub da jini mai yawa ka kuma yi yaƙe-yaƙe masu yawa. Ba za ka gina gida domin Sunana ba, domin ka zub da jini da yawa a duniya a idona."
        ]
      },
      {
        "type": "verse",
        "number": 9,
        "content": [
          "Amma za ka haifi ɗa wanda zai zama mutumin salama da kuma hutu, zan kuma ba shi hutu daga dukan abokan gābansa a kowane gefe. Za a kira shi Solomon, zai kuma kawo wa Isra’ila salama da natsuwa a zamanin mulkinsa."
        ]
      },
      {
        "type": "verse",
        "number": 10,
        "content": [
          "Shi ne wanda zai gina gida saboda Sunana. Zai zama ɗana, ni kuma zan zama mahaifinsa. Zan kafa kujerar sarautarsa a bisa Isra’ila har abada.’"
        ]
      },
      {
        "type": "verse",
        "number": 11,
        "content": [
          "“Yanzu, ɗana, Ubangiji ya kasance tare da kai, bari kuma ka yi nasara ka kuma gina gidan Ubangiji Allahnka, kamar yadda ya ce za ka yi."
        ]
      },
      {
        "type": "verse",
        "number": 12,
        "content": [
          "Bari Ubangiji ya ba ka basira da fahimi sa’ad da ya sa ka shugaba a bisa Isra’ila, saboda ka kiyaye dokar Ubangiji Allahnka."
        ]
      },
      {
        "type": "verse",
        "number": 13,
        "content": [
          "Ta haka za ka yi nasara in ka mai da hankali ga kiyaye ƙa’idodi da dokokin da Ubangiji ya ba wa Musa saboda Isra’ila. Ka yi ƙarfin hali ka kuma ƙarfafa. Kada ka ji tsoro ko ka fid da zuciya."
        ]
      },
      {
        "type": "verse",
        "number": 14,
        "content": [
          "“Na sha wahala da yawa don in yi tanadi talentin dubu ɗari na zinariya, talenti miliyon na azurfa, ɗumbun tagulla da ƙarfe da suka wuce ƙirge da katako da dutse saboda haikalin Ubangiji. Za ka iya ƙara su."
        ]
      },
      {
        "type": "verse",
        "number": 15,
        "content": [
          "Kana da ma’aikata masu yawa, masu fafarshe duwatsu, masu gini da masu aikin katako, da kuma gwanaye a kowane irin aikin"
        ]
      },
      {
        "type": "verse",
        "number": 16,
        "content": [
          "zinariya da azurfa, tagulla da ƙarfe, masu sana’a waɗanda suka wuce ƙirge. Yanzu ka fara aiki, Ubangiji kuma ya kasance tare da kai.”"
        ]
      },
      {
        "type": "verse",
        "number": 17,
        "content": [
          "Sai Dawuda ya umarta dukan shugabannin Isra’ila su taimake ɗansa Solomon."
        ]
      },
      {
        "type": "verse",
        "number": 18,
        "content": [
          "Ya ce musu, “Ba Ubangiji Allahnku yana tare da ku ba? Bai kuma ba ku hutu a kowane gefe ba? Gama ya ba da mazaunan ƙasar gare ni, ƙasar kuma ta Ubangiji ce da mutanensa."
        ]
      },
      {
        "type": "verse",
        "number": 19,
        "content": [
          "Yanzu fa sai ku sa zuciyarku da ranku ga neman Ubangiji Allahnku. Ku fara ginin wuri mai tsarki na Ubangiji Allah, don ku kawo akwatin alkawarin Ubangiji da kayayyaki masu tsarki na Allah a cikin haikalin da za a gina saboda Sunan Ubangiji.”"
        ]
      }
    ],
    "footnotes": []
  },
  "thisChapterLink": "/api/hau_bib/1CH/22.json",
  "thisChapterAudioLinks": {},
  "nextChapterApiLink": "/api/hau_bib/1CH/23.json",
  "nextChapterAudioLinks": {},
  "previousChapterApiLink": "/api/hau_bib/1CH/21.json",
  "previousChapterAudioLinks": {},
  "numberOfVerses": 19
}